#### LossFactor Members

---

|  |
| --- |
| LossFactor Class   Methods   Properties   See Also |

The  LossFactor  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clone | Creates a copy of the LossFactor derived object. |
| Public method | Dispose | Releases all resources used by the  LossFactor |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LossFactorValue | The calculated loss factor value |

# See Also

LossFactor Class

Autodesk.Revit.DB.Lighting Namespace